In [3]:
import pandas as pd
df=pd.read_csv("cafe4.csv")
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20   과테말라     NaN
5    밀크티  5900  210   과테말라     NaN
6     녹차  5300    0   대한민국     NaN
7   구미라떼  2000   20  코스타리카     NaN

In [ ]:
# 그룹 기준 1개

df.groupby(["원산지"]).mean(numeric_only=True)

# sum(), max(), min(), count()

           가격    칼로리    이벤트가
원산지
과테말라   5100.0  147.5  1000.0
대한민국   5300.0    0.0     NaN
코스타리카  3500.0   65.0  1000.0
콜롬비아   4500.0   10.0     NaN

In [ ]:
# 그룹 기준 2개 이상

df2=df.groupby(["원산지", "칼로리"]).mean(numeric_only=True)
df2.reset_index() # 병합된 행렬 풀어줌

     원산지  칼로리      가격    이벤트가
0   과테말라   20  4000.0     NaN
1   과테말라  110  5000.0     NaN
2   과테말라  210  5900.0     NaN
3   과테말라  250  5500.0  1000.0
4   대한민국    0  5300.0     NaN
5  코스타리카   20  2000.0     NaN
6  코스타리카  110  5000.0  1000.0
7   콜롬비아   10  4500.0     NaN